<a href="https://colab.research.google.com/github/Nahidjc/Al_Lab/blob/main/PerformanceBank.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
from google.colab import drive
drive.mount('/content/gdrive')

Mounted at /content/gdrive

In [2]:
import pandas as pd
train_dataset = pd.read_csv('gdrive/My Drive/Colab Notebooks/Lab-PerformanceBank-Refund.csv')

In [3]:
train_dataset.head()

   ID Refund Marrital Status  Inc.Tex Cheat
0   1    Yes          Single    12500    No
1   2     No         Married    10000    No
2   3    Yes         Married    70000    No
3   4     No          Single   120000    No
4   5    Yes         Married    95000   Yes

In [4]:
train_dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16 entries, 0 to 15
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   ID               16 non-null     int64
 1   Refund           16 non-null     object
 2   Marrital Status  16 non-null     object
 3   Inc.Tex          16 non-null     int64
 4   Cheat            16 non-null     object
dtypes: int64(2), object(3)
memory usage: 768.0+ bytes

In [5]:
Refund_mapping={'Yes':1,'No':0}

In [6]:
train_data = [train_dataset]
for train in train_data:
   train['Refund']=train['Refund'].map(Refund_mapping)

In [7]:
train_dataset.head()

   ID  Refund Marrital Status  Inc.Tex Cheat
0   1       1          Single    12500    No
1   2       0         Married    10000    No
2   3       1         Married    70000    No
3   4       0          Single   120000    No
4   5       1         Married    95000   Yes

In [8]:
Marrital_mapping={'Married':1,'Single':0}

In [18]:
Cheat_mapping={'Yes':1,'No':0}

In [10]:
train_data = [train_dataset]
for train in train_data:
   train['Cheat']=train['Cheat'].map(Cheat_mapping)

In [11]:
train_dataset.head()

   ID  Refund Marrital Status  Inc.Tex  Cheat
0   1       1          Single    12500      0
1   2       0         Married    10000      0
2   3       1         Married    70000      0
3   4       0          Single   120000      0
4   5       1         Married    95000      1

In [12]:
Marrital_mapping={'Married':1,'Single':0}
train_data = [train_dataset]
for train in train_data:
   train['Marrital Status']=train['Marrital Status'].map(Marrital_mapping)

In [16]:
train_dataset.head(10)

   ID  Refund  Marrital Status  Inc.Tex  Cheat
0   1       1                0    12500      0
1   2       0                1    10000      0
2   3       1                1    70000      0
3   4       0                0   120000      0
4   5       1                1    95000      1
5   6       0                0    60000      0
6   7       0                0   220000      0
7   8       0                0    85000      1
8   9       1                1    75000      0
9  10       1                1    90000      1

In [17]:
train_dataset.dtypes

ID                 int64
Refund             int64
Marrital Status    int64
Inc.Tex            int64
Cheat              int64
dtype: object

In [20]:
train_data = train_dataset.drop('Cheat',axis=1)
target = train_dataset['Cheat']
train_data.shape
target.shape

(16,)

In [21]:
train_data.isnull().sum()

ID                 0
Refund             0
Marrital Status    0
Inc.Tex            0
dtype: int64

In [23]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test = train_test_split(train_data,target,test_size=0.2,random_state=42)
print("X_Train",x_train.shape)
print("X_Test",x_test.shape)

X_Train (12, 4)
X_Test (4, 4)

In [26]:
print(x_train)

    ID  Refund  Marrital Status  Inc.Tex
13  14       1                1    95000
11  12       0                0    80000
8    9       1                1    75000
9   10       1                1    90000
2    3       1                1    70000
15  16       1                0    78000
4    5       1                1    95000
7    8       0                0    85000
10  11       0                0    55000
12  13       0                1    11000
3    4       0                0   120000
6    7       0                0   220000

In [24]:
train_data.head()

   ID  Refund  Marrital Status  Inc.Tex
0   1       1                0    12500
1   2       0                1    10000
2   3       1                1    70000
3   4       0                0   120000
4   5       1                1    95000